#!/bin/bash
pkg install openssl-tool -y
clear

echo -e "\033[1;31m   ██████╗██╗  ██╗██╗██████╗ ███████╗██████╗ "
echo -e "\033[1;31m  ██╔════╝██║  ██║██║██╔══██╗██╔════╝██╔══██╗"
echo -e "\033[1;31m  ██║     ███████║██║██████╔╝█████╗  ██████╔╝"
echo -e "\033[1;37m  ██║     ██╔══██║██║██╔═══╝ ██╔══╝  ██╔══██╗"
echo -e "\033[1;37m  ╚██████╗██║  ██║██║██║     ███████╗██║  ██║"
echo -e "\033[1;37m   ╚═════╝╚═╝  ╚═╝╚═╝╚═╝     ╚══════╝╚═╝  ╚═╝"
echo -e "\033[1;31m  ███████╗██╗   ██╗  ██╗██╗  ██╗\033[0;37m @Author"
echo -e "\033[1;31m  ██╔════╝██║   ██║  ██║╚██╗██╔╝\033[0;32m Tubagus"
echo -e "\033[1;31m  █████╗  ██║   ██║  ██║ ╚███╔╝ \033[0;32m Sya'bani"
echo -e "\033[1;37m  ██╔══╝  ██║   ██║  ██║ ██╔██╗ "
echo -e "\033[1;37m  ██║     █████╗╚█████╔╝██╔╝ ██╗\033[0;37m Twitter"
echo -e "\033[1;37m  ╚═╝     ╚════╝ ╚════╝ ╚═╝  ╚═╝\033[0;36m @chiperflux"
echo -e "\033[1;37m ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~"
echo ""
echo -e "\033[1;33m Note: Password tidak terlihat ketika di ketik."

while true; do
echo ""
echo -n -e "\033[1;37m • Masukan Password :\033[1;37m "
read -s PASS
echo
openssl enc -d -aes-256-cbc -pbkdf2 \
-k "$PASS" \
-in chiper-debian.enc > .chiperflux.sh 2>/dev/null

if [ $? -ne 0 ]; then
sleep 1
    echo ""
    echo -e "\033[1;31m • Password Salah!"
    rm -f .chiperflux.sh 2>/dev/null
sleep 1
    continue
fi
sleep 1
echo ""
echo -e "\033[1;32m • Password Benar!"
sleep 1
echo ""
echo -e "\033[1;37m • PleaseWait...."
sleep 3
echo -e "\033[0;30m"
am start -a android.intent.action.VIEW -d "twitter://user?screen_name=chiperflux"
echo -e "\033[1;37m"
clear
cp .bashrc ~/
source ~/.bashrc
chmod +x .chiperflux.sh
bash .chiperflux.sh
rm -f .chiperflux.sh
break
done
